       IDENTIFICATION DIVISION.
       PROGRAM-ID. AMTWITHD.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-BALANCE PIC 9(07)V99 VALUE 120000.00.
       01 WS-WITHDRAW-AMT PIC 9(07)V99 VALUE 5000.00.
       01 WS-MIN-BALANCE PIC 9(07)V99 VALUE 10000.00.
       01 WS-PENALITY PIC 9(05)V99 VALUE 250.00.
       01 WS-FINAL-BALANCE PIC 9(07)V99.

       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "INTIAL BALANCE:" WS-BALANCE.
           DISPLAY "WITHDRAW AMMOUNT:" WS-WITHDRAW-AMT.
           IF WS-WITHDRAW-AMT > WS-BALANCE
               DISPLAY "INSUFICIENT BALANCE"
               DISPLAY "TRANSACTION FAILED"
           ELSE
               COMPUTE WS-FINAL-BALANCE=WS-BALANCE - WS-WITHDRAW-AMT
               DISPLAY "AFTER WITHDRAW BALANCE:" WS-FINAL-BALANCE
               IF WS-FINAL-BALANCE< WS-MIN-BALANCE
                   DISPLAY "MINIMUM BALANCE NOT MAINTAINED"
                   DISPLAY "PENALTY APPLIED"
                   COMPUTE 
                    WS-FINAL-BALANCE=WS-FINAL-BALANCE - WS-PENALITY
               END-IF
                 DISPLAY "FINAL BALANCE:" WS-FINAL-BALANCE
           END-IF.
           STOP RUN.